Repository: QianLight/ShaderPerformance
Catalog: Assets/GMSDK/GMSDK/Editor/Scripts/DeployIOS/Localisations/infoPlist/*.lproj/InfoPlist.strings
Languages: ar, de, es, fr, id, it, ja, ko, pt, ru, th, tr, vi, zh_hans, zh_hant

# NSMicrophoneUsageDescription
source: Enable microphone access to send voice messages.
ar: قم بتمكين الوصول إلى الميكروفون لإرسال رسائل صوتية.
de: Aktiviere den Mikrofonzugriff, um Sprachnachrichten zu senden.
es: Habilita el acceso al micrófono para enviar mensajes de voz.
fr: Activez l'accès au microphone pour envoyer des messages vocaux.
id: Aktifkan akses mikrofon untuk mengirim pesan suara.
it: Abilita l'accesso al microfono per inviare messaggi vocali.
ja: マイクへのアクセスを許可して、音声メッセージを送信します。
ko: 음성 메시지를 보내기 위해 마이크 권한을 활성화해 주세요.
pt: Permita o acesso ao Microfone para enviar mensagens de voz.
ru: Включите доступ к микрофону для отправки голосовых сообщений.
th: อนุญาตให้แอปสามารถบันทึกเสียงด้วยไมโครโฟน
tr: Sesli mesaj göndermek için mikrofon erişimini etkinleştirin.
vi: Bật quyền truy cập micrô để gửi tin nhắn thoại.
zh_hans: 申请麦克风权限，用于发送语音消息
zh_hant: 開啟麥克風訪問權限以發送語音消息

# NSLocationWhenInUseUsageDescription
source: Turn on location service to help us provide location related services.
ar: قم بتمكين خدمة الموقع لمساعدتنا في تقديم الخدمات المتعلقة بالموقع.
de: Aktiviere den Standortdienst, um standortbezogene Dienste bereitzustellen.
es: Activa el servicio de ubicación para ayudarnos a proporcionar servicios relacionados con la ubicación.
fr: Activez le service de localisation pour nous aider à fournir des services liés à la localisation.
id: Aktifkan layanan lokasi untuk membantu kami menyediakan layanan terkait lokasi.
it: Attiva il servizio di localizzazione per aiutarci a fornire informazioni relative alla posizione.
ja: 位置情報サービスへのアクセスを許可して、特殊の状況下で位置を取得します。
ko: 특수한 상황에 위치를 추적하기 위해 위치 권한을 활성화해 주세요.
pt: Permita o serviço de Localização para nos ajudar a fornecer serviços relacionados à localização.
ru: Включите службу определения местоположения, чтобы мы могли предоставлять услуги, связанные с определением местоположения.
th: เปิดใช้งานบริการระบุตำแหน่งในกรณีพิเศษ
tr: Konumla ilgili hizmetleri sağlamamıza yardımcı olması için konum hizmetini açın.
vi: Bật dịch vụ vị trí để giúp chúng tôi cung cấp các dịch vụ liên quan đến vị trí.
zh_hans: 申请定位信息，用于特殊情况下获取粗略定位
zh_hant: 開啟定位服務以幫助我們提供位置相關的服務

# NSPhotoLibraryUsageDescription
source: Allow access to your photo library to enable photo sharing to social media.
ar: قم بتمكين الوصول إلى مكتبة الصور الخاصة بك لمشاركة الصور على وسائل التواصل الاجتماعي.
de: Ermöglich den Zugriff auf deine Fotobibliothek, um die Fotos in soziale Medien zu teilen.
es: Permita el acceso a tu biblioteca de fotos para compartirlas en las redes sociales.
fr: Autorisez l'accès à votre photothèque pour activer le partage de photos sur les réseaux sociaux.
id: Izinkan akses ke perpustakaan foto Anda untuk mengaktifkan berbagi foto ke media sosial.
it: Consente l'accesso agli album per condividere le foto sui social media.
ja: 写真へのアクセスを許可してシェアします。
ko: 소셜 네트워크에 공유하기 위해 앨범 권한을 활성화해 주세요.
pt: Permita o acesso à sua Galeria para permitir o compartilhamento de fotos na Internet.
ru: Разрешите доступ к своей фото-библиотеке, чтобы разрешить публикацию фотографий в социальных сетях.
th: อนุญาตให้แอปเข้าถึงรูปภาพของคุณ เพื่อแบ่งปันไปยังโซเชียลมีเดีย
tr: Sosyal medyada fotoğraf paylaşımını etkinleştirmek için fotoğraf kitaplığınıza erişime izin verin.
vi: Cho phép truy cập vào thư viện ảnh của bạn để cho phép chia sẻ ảnh lên mạng xã hội.
zh_hans: 申请访问相册，用于社交分享
zh_hant: 允許訪問您的照片庫以允許將照片共享到社交媒體

# NSPhotoLibraryAddUsageDescription
source: Allow access to your photo library to save the photos you like.
ar: قم بتمكين الوصول إلى مكتبة الصور لحفظ الصور التي تريدها.
de: Ermöglich den Zugriff auf deine Fotobibliothek, um die gewünschten Fotos zu speichern.
es: Permita el acceso a tu biblioteca de fotos para guardar las fotos que deseas.
fr: Autorisez l'accès à votre photothèque pour enregistrer les photos que vous aimez.
id: Izinkan akses ke perpustakaan foto Anda untuk menyimpan foto yang Anda suka.
it: Consente l'accesso agli album per salvare le foto che ti piacciono.
ja: 写真へのアクセスを許可して、画像を保存します。
ko: 소셜 네트워크에 공유하기 위해 이미지 저장 권한을 활성화해 주세요.
pt: Permita o acesso à sua Galeria para salvar as fotos a compartilhar as fotos na Internet.
ru: Разрешите доступ к своей фото-библиотеке, чтобы сохранять понравившиеся фотографии.
th: อนุญาตให้แอปบันทึกรูปภาพ เพื่อแบ่งปันไปยังโซเชียลมีเดีย
tr: Beğendiğiniz fotoğrafları kaydetmek için fotoğraf kitaplığınıza erişime izin verin.
vi: Cho phép truy cập vào thư viện ảnh của bạn để lưu ảnh bạn thích.
zh_hans: 申请存储图片到相册，用于社交分享
zh_hant: 允許訪問您的照片庫以保存您喜歡的照片

# NSCameraUsageDescription
source: Allow access to the camera to take pictures and record videos.
ar: قم بتمكين الوصول إلى الكاميرا لالتقاط الصور وتسجيل مقاطع الفيديو.
de: Ermöglich den Zugriff auf die Kamera, um Bilder und Videos aufzunehmen.
es: Permita el acceso a la cámara para tomar fotografías y grabar videos.
fr: Autorisez l'accès à l'appareil photo pour prendre des photos et enregistrer des vidéos.
id: Izinkan akses ke kamera untuk mengambil gambar dan merekam video.
it: Consente l'accesso alla fotocamera per scattare foto e registrare video.
ja: カメラへのアクセスを許可して、シェアします。
ko: 소셜 네트워크에 공유하기 위해 촬영 권한을 활성화해 주세요.
pt: Permita o acesso à Câmera para tirar fotos e gravar vídeos a compartilhar as fotos e vídeos na Internet.
ru: Разрешите доступ к камере, чтобы делать снимки и записывать видео.
th: อนุญาตให้แอปถ่ายภาพและวิดีโอด้วยกล้องถ่ายรูป เพื่อแบ่งปันไปยังโซเชียลมีเดีย
tr: Fotoğraf çekmek ve video kaydetmek için kameraya erişime izin verin.
vi: Cho phép truy cập vào máy ảnh để chụp ảnh và quay video.
zh_hans: 申请拍摄权限，用于社交分享
zh_hant: 允許使用相機拍照和錄製視頻

# NSContactsUsageDescription
source: This allows us to find your friends who are also playing this game.
ar: قم بتمكين الوصول إلى دليل العناوين لتحديد على أصدقائك الذين يلعبون هذه اللعبة أيضًا.
de: Auf diese Weise können wir deine Freunde finden, die auch dieses Spiel spielen.
es: Esto nos permite encontrar a tus amigos que también juegan a este juego.
fr: Cela nous permet de trouver vos amis qui jouent également à ce jeu.
id: Ini memungkinkan kami menemukan teman Anda yang juga memainkan game ini.
it: Abilita la rubrica dei contatti per trovare i tuoi amici che stanno giocando a questo gioco.
ja: 連絡先へのアクセスを許可して、フレンドのおすすめ機能を使用します。
ko: 친구추천 기능을 사용하기 위해 연락처 권한을 활성화해 주세요.
pt: Permita o acesso ao Contatos para fazer a recomendação de amigos.
th: ขอเข้าถึงรายชื่อผู้ติดต่อของคุณ เพื่อค้นหาเพื่อนที่เล่นเกมเดียวกัน
tr: Bu, aynı zamanda bu oyunu oynayan arkadaşlarınızı bulmamızı sağlar.
vi: Điều này cho phép chúng tôi tìm bạn bè của bạn cũng đang chơi trò chơi này.
zh_hans: 需要您的通讯录权限，进行好友推荐
zh_hant: 允許訪問通訊錄，使我們可以找到也在玩此遊戲的朋友

# NSUserTrackingUsageDescription
source: We will only use the device identifier to deliver a better user experience and improve service security. This won't give us access to your private data on other sites.
ar: يُرجى الاطمئنان إلى أنه لا يمكننا الدخول على خصوصيتك عبر التطبيقات الأخرى، حيث ان يتم استخدام هذا الإذن فقط لتحديد الجهاز ولضمان أمان الخدمة وتحسين تجربة العب
de: Wir werden nur die Gerätekennung verwenden, um eine bessere Benutzererfahrung anzubieten und die Service-Sicherheit zu verbessern. Deshalb erhalten wir keinen Zugriff auf deine privaten Daten in anderen Websites.
es: Usaremos solo el identificador de dispositivo para ofrecer una mejor experiencia de usuario y mejorar la seguridad del servicio. Esto no nos permitirá acceder a sus datos privados en otros sitios.
fr: Nous utiliserons l'idnetifiqnt de l'appareil uniquement pour offrir votre meilleure expérience et améliorer la sécurité du service. Cela ne nous donnera pas accès à vos données privées sur d'autres sites.
id: Jangan khawatir, kami tidak dapat memperoleh informasi pribadi Anda pada aplikasi lain. Pengaktifan izin hanya digunakan untuk mengidentifikasi perangkat dan untuk memastikan keamanan layanan serta meningkatkan pengalaman bermain game.
it: Ti assicuriamo che non otteniamo i tuoi dati di privacy in altre app. L'autorizzazione viene utilizzata solo per identificare il dispositivo e garantire la sicurezza del servizio e migliorare l'esperienza di gioco
ja: この権限はデバイスの識別とサービス体験やセキュリティ向上のみに使われます。他のアプリやサイトでの個人情報を取得できません。
ko: 다른 앱 내에서의 프라이버시는 가져올 수 없습니다, 오픈 권한은 장비 표기로 만 사용되며, 서비스 안전과 게임 체험의 업그레이드를 보장해 드립니다.
pt: Usaremos somente o identificador de dispositivo para fornecer uma experiência melhor do usuário e melhorar a segurança do serviço. Isso não nos dará o acesso aos seus dados privados em outros sites.
ru: Будьте уверены,что у нас нет доступа к вашей конфиденциальности в других приложениях, разрешение на доступ используется только для идентификации устройства, обеспечения безопасности сервиса и улучшения игрового опыта
th: โปรดมั่นใจได้ว่า ทางเราไม่สามารถดูข้อมูลส่วนตัวของท่านจากช่องทางอื่นๆได้ การอนุญาติครั้งนี้จะใช้เพื่อการระบุตั้งค่าอุปกรณ์เพิ่มความปลอดภัยในการให้บริการเท่านั้น
tr: Lütfen diğer uygulamalarda gizliliğinize ulaşamayacağımızdan emin olabilirsiniz, açma izni sadece cihazı tanımlamak , hizmet güvenliğini korumak ve oyun deneyimini geliştirmek için kullanılır.
vi: Bạn hoàn toàn có thể yên tâm, chúng tôi không thể lấy thông tin cá nhân của bạn ở các ứng dụng khác. Bật quyền truy cập chỉ dùng để nhận biết thiết bị và đảm bảo an toàn dịch vụ, nâng cao trải nghiệm trò chơi.
zh_hans: 请放心，我们无法获取你在其他应用内的隐私，开启权限仅用于标识设备并保障服务安全与提升游戏体验
zh_hant: 請放心，我們無法獲取你在其他應用內的隱私，開啟權限僅用於標識設備並保障服務安全與提升遊戲體驗

# NSLocationAlwaysUsageDescription
source: Turn on background location to enjoy advanced features.
ar: قم بتشغيل في الخلفية للاستمتاع الميزات المتقدمة.
de: Aktiviere die Stelle des Hintergrundes, um erweiterte Funktionen zu nutzen.
es: Activa la ubicación en segundo plano para disfrutar de funciones avanzadas.
fr: Activez la localisation en arrière-plan pour profiter des fonctionnalités avancées.
id: Aktifkan lokasi latar belakang untuk menikmati fitur lanjutan.
it: Richiede la posizione in background per usufruire delle funzionalità avanzate.
ja: 位置情報サービスへのアクセスを許可します。
ko: 위치추적 권한 활성화
pt: Permita o acesso ao Localização continuamente.
ru: Включите фоновое местоположение, чтобы пользоваться расширенными функциями.
th: อนุญาตให้แอปเข้าถึงตำแหน่งของคุณตลอดเวลา
tr: Gelişmiş özelliklerin keyfini çıkarmak için arka planda konumu açın.
vi: Bật vị trí nền để tận hưởng các tính năng nâng cao.
zh_hans: 获取持续使用位置隐私权限
zh_hant: 獲取持續使用位置隱私權限

# NSCalendarsUsageDescription
source: This feature needs to access your calendar.
ar: تحتاج الوصول إلى التقويم للاستمتاع هذه الميزة
de: Diese Funktion muss auf deinen Kalender zugreifen können.
es: Esta función necesita acceder a tu calendario.
fr: Cette fonctionnalité doit accéder à votre calendrier.
id: Fitur ini perlu mengakses kalender Anda.
it: Abilita l'accesso al tuo calendario.
ja: カレンダーへのアクセスを許可します。
ko: 달력 읽는 권한 활성화
pt: Permita o acesso ao Localização continuamente.
ru: Этой функции необходим доступ к вашему календарю.
th: อนุญาตให้แอปอ่านเหตุการณ์บนปฏิทินและรายละเอียด
tr: Bu özelliğin takviminize erişmesi gerekiyor.
vi: Tính năng này cần truy cập vào lịch của bạn.
zh_hans: 获取日历读取隐私权限
zh_hant: 此功能需要訪問您的日曆

# NSRemindersUsageDescription
source: Allow us to send you notifications.
ar: اسمح لـنا بإرسال إشعارات إليك
de: Erlaub uns, die Benachrichtigungen zu senden.
es: Permítanos enviarte notificaciones.
fr: Permettez-nous de vous envoyer des notifications.
id: Izinkan kami mengirimkan pemberitahuan kepada Anda.
it: Attiva le notifiche.
ja: リマインダーへのアクセスを許可します。
ko: 달력 읽는 권한 활성화
pt: Permita-nos enviar notificações para você.
ru: Разрешите нам отправлять вам уведомления.
th: อนุญาตให้แอปส่งการแจ้งเตือน
tr: Size bildirim göndermemize izin verin.
vi: Cho phép chúng tôi gửi thông báo cho bạn.
zh_hans: 获取添加提醒隐私权限
zh_hant: 允許我們向您發送通知

# NSSpeechRecognitionUsageDescription
source: Allow us to use Speech Recognition.
ar: اسمح لنا باستخدام التعرف على الكلام.
de: Erlaub uns, die Spracherkennung zu verwenden.
es: Permítanos utilizar el Reconocimiento de Voz.
fr: Permettez-nous d'utiliser la reconnaissance vocale.
id: Izinkan kami menggunakan Pengenalan Ucapan.
it: Attiva il riconoscimento vocale.
ja: 音声認識へのアクセスを許可します。
ko: 음성인식 관한 활성화
pt: Permita o acesso ao Reconhecimento de Voz.
ru: Позвольте нам использовать распознавание речи.
th: อนุญาตให้แอปใช้บริการการรู้จักเสียง
tr: Konuşma Tanıma'yı kullanmamıza izin verin.
vi: Cho phép chúng tôi sử dụng Nhận dạng giọng nói.
zh_hans: 获取语音识别隐私权限
zh_hant: 允許我們使用語音識別

# NSSiriUsageDescription
source: Allow us to interact with Siri.
ar: السماح بالتفاعل مع Siri.
de: Erlaub die Interaktion mit Siri.
es: Permita la interacción con Siri.
fr: Autorisez l'interaction avec Siri.
id: Izinkan interaksi dengan Siri.
it: Attiva l'interazione con Siri.
ja: Siriモジュールへのアクセスを許可します。
ko: Siri 관한 활성화
pt: Permita o acesso ao Siri.
ru: Разрешить взаимодействие с Siri.
th: อนุญาตให้แอปใช้งาน Siri
tr: Siri ile etkileşime izin verin.
vi: Cho phép tương tác với Siri.
zh_hans: 获取Siri模块隐私权限
zh_hant: 允許我們與Siri互動

# NSFaceIDUsageDescription
source: Allow us to use Face ID to verify your identity.
ar: اسمح لنا باستخدام Face ID للتحقق من هويتك.
de: Erlaub uns, Face ID zu verwenden, um deine Identität zu überprüfen.
es: Permítanos usar Face ID para verificar tu identidad.
fr: Permettez-nous d'utiliser Face ID pour vérifier votre identité.
id: Izinkan kami menggunakan ID Wajah untuk memverifikasi identitas Anda.
it: Attiva la funzione di Face ID per verificare la tua identità.
ja: FaceIDへのアクセスを許可します。
ko: Face ID 권한 활성화
pt: Permita o acesso ao Face ID .
ru: Разрешите нам использовать Face ID для подтверждения вашей личности.
th: อนุญาตให้แอปใช้งาน Face ID เพื่อยืนยันตัวตน
tr: Kimliğinizi doğrulamak için Face ID kullanmamıza izin verin.
vi: Cho phép chúng tôi sử dụng Face ID để xác minh danh tính của bạn.
zh_hans: 获取FaceID使用隐私权限
zh_hant: 允許我們使用Face ID驗證您的身份
